Cylinder Flow/Re_3/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         200.0;
deltaT          0.05;
writeControl    adjustableRunTime;
writeInterval   10;
purgeWrite      5;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           0.8;
maxDeltaT       2.5;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   10;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         4.5e-05;
        lRef            1;
        Aref            1;
    }
}
