Cylinder Flow/Re_3/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
ddtSchemes      { default Euler; }
gradSchemes     { default Gauss linear; }
divSchemes
{
    default                                 none;
    div(phi,U)                              Gauss linearUpwind grad(U);
    div(phi,k)                              Gauss linearUpwind grad(k);
    div(phi,omega)                          Gauss linearUpwind grad(omega);
    div((nuEff*dev(T(grad(U)))))            Gauss linear;
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
